case/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\
| Ahmed body - pressione cinematica p/rho                                     |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    Body
    {
        type            zeroGradient;
    }

    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            symmetryPlane;
    }

    sideMin
    {
        type            symmetryPlane;
    }

    sideMax
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
