case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| Ahmed body - modello di turbolenza                                          |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    model           kOmegaSST;
    turbulence      on;
    printCoeffs     on;      
}

// ************************************************************************* //
