case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     |                                                 |
|   \\  /    A nd           | Ahmed body - external aerodynamics              |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

// ---------------------------------------------------------------------------
// Estensione del dominio.
// Ricavala dal bounding box dell'STL:  surfaceCheck constant/geometry/<file>.stl
// Convenzione usata qui: x = corrente, y = laterale, z = verticale.
// ---------------------------------------------------------------------------

xMin   -5.0;    //(monte del muso)
xMax    6.0;    //(valle della base)
yMin   -1.0;    
yMax    1.0;    
zMin    -0.05;    //(quota del pavimento)
zMax    1.95;   

// Celle della mesh di sfondo. Devono essere il piu' possibile cubiche:
// snappyHexMesh raffina dimezzando, quindi parte da questa forma.
nx     110;      
ny     20;      
nz     20;      

vertices
(
    (-5 -1 -0.05)    // 0
    (6 -1 -0.05)    // 1
    (6 1 -0.05)    // 2
    (-5 1 -0.05)    // 3
    (-5 -1 1.95)    // 4
    (6 -1 1.95)    // 5
    (6 1 1.95)    // 6
    (-5 1 1.95)    // 7
);


blocks
(
    hex (0 1 2 3 4 5 6 7) ($nx $ny $nz) simpleGrading (1 1 1)
);

edges
(
);

// I quattro vertici di ogni faccia sono ordinati in modo che la normale
// esca dal dominio.
boundary
(
    inlet
    {
        type    patch;
        faces   ( (0 4 7 3) );
    }

    outlet
    {
        type    patch;
        faces   ( (1 2 6 5) );
    }

    bottom
    {
        type    wall;
        faces   ( (0 3 2 1) );
    }

    top
    {
        type    symmetryPlane;
        faces   ( (4 5 6 7) );
    }

    sideMin
    {
        type    symmetryPlane;
        faces   ( (0 1 5 4) );
    }

    sideMax
    {
        type    symmetryPlane;
        faces   ( (3 7 6 2) );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
